### 확인문제

#### 1번

In [50]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    '메뉴':['아메리카노','카페라떼','에스프레소','카페모카','바닐라라떼'],
    '가격':[4500,5000,4000,5900,5300],
    '칼로리':[10,110,np.nan,210,np.nan],
    '원산지':['과테말라','브라질','과테말라',np.nan,np.nan]
})

df

      메뉴    가격    칼로리   원산지
0  아메리카노  4500   10.0  과테말라
1   카페라떼  5000  110.0   브라질
2  에스프레소  4000    NaN  과테말라
3   카페모카  5900  210.0   NaN
4  바닐라라떼  5300    NaN   NaN

In [51]:
# 1-1
# '칼로리' 컬럼의 결측치를 칼로리 데이터 중 최솟값으로 채우시오.

df['칼로리'] = df['칼로리'].fillna(df['칼로리'].min())

In [52]:
# 1-2
# '원두' 컬럼의 결측치를 원산지 데이터 중 최반값으로 채우시오.
f = df['원산지'].mode()[0]
df['원산지'] = df['원산지'].fillna(f)
df

      메뉴    가격    칼로리   원산지
0  아메리카노  4500   10.0  과테말라
1   카페라떼  5000  110.0   브라질
2  에스프레소  4000   10.0  과테말라
3   카페모카  5900  210.0  과테말라
4  바닐라라떼  5300   10.0  과테말라

In [53]:
# 1-3
# 가격이 5,000 이상인 데이터의 수를 구하시오.

conf = df['가격']>=5000

len(df[conf])

3

In [54]:
# 1-4
# 이벤트가 컬럼을 만들고 기존 가격에서 50% 할인된 가격을 채우시오.

df['이벤트가'] = df['가격']*0.5

In [55]:
# 1-5
# '칼로리' 컬럼을 삭제

df = df.drop('칼로리',axis=1)
df

      메뉴    가격   원산지    이벤트가
0  아메리카노  4500  과테말라  2250.0
1   카페라떼  5000   브라질  2500.0
2  에스프레소  4000  과테말라  2000.0
3   카페모카  5900  과테말라  2950.0
4  바닐라라떼  5300  과테말라  2650.0

In [56]:
# 1-6
# 위에서부터 3개의 행만 선택 (loc 사용)

df.loc[:2]

      메뉴    가격   원산지    이벤트가
0  아메리카노  4500  과테말라  2250.0
1   카페라떼  5000   브라질  2500.0
2  에스프레소  4000  과테말라  2000.0

In [57]:
# 1-7
# 위에서부터 3개의 행만 선택 (iloc 사용)

df.iloc[:3]

      메뉴    가격   원산지    이벤트가
0  아메리카노  4500  과테말라  2250.0
1   카페라떼  5000   브라질  2500.0
2  에스프레소  4000  과테말라  2000.0

In [58]:
# 1-8
# 주어진 데이터에서 아래 값을 loc를 활용해 데이터 프레임으로 출력하시오.

df.loc[1:2,:'가격']

      메뉴    가격
1   카페라떼  5000
2  에스프레소  4000

In [59]:
# 1-9
# 주어진 데이터에서 아래 값을 iloc를 활용해 데이터 프레임으로 출력하시오.

df.iloc[1:3,:2]

      메뉴    가격
1   카페라떼  5000
2  에스프레소  4000

In [62]:
# 1-10
# 메뉴 중 가격이 가장 비싼 순으로 정렬해 상위 3개의 값을 구하시오.

df=df.sort_values('가격', ascending=False)
df.iloc[:3]

      메뉴    가격   원산지    이벤트가
3   카페모카  5900  과테말라  2950.0
4  바닐라라떼  5300  과테말라  2650.0
1   카페라떼  5000   브라질  2500.0